In [1]:
import pandas as pd

4.2.4 Задание 
Загрузим "log.csv" в dataframe log с помощью read_csv. Не передавайте никаких дополнительных параметров!
В результате переменная log должна содержать загруженный из файла датафрейм. Напишите код загрузки:

In [2]:
log = pd.read_csv('log.xls')

In [22]:
log.head()

                            user_id                  time  bet  win
0  Запись пользователя № - user_919  [2019-01-01 14:06:51  NaN  NaN
1  Запись пользователя № - user_973  [2019-01-01 14:51:16  NaN  NaN
2  Запись пользователя № - user_903  [2019-01-01 16:31:16  NaN  NaN
3  Запись пользователя № - user_954  [2019-01-01 17:17:51  NaN  NaN
4  Запись пользователя № - user_954  [2019-01-01 21:31:18  NaN  NaN

4.4.2. Задание 
Заметили, что с заголовком у нас что-то не так? 
Давайте сделаем так, чтобы Pandas не считал первую строку заголовком. Поместите CSV-файл в переменную log как файл без заголовка. Файл находится по адресу "log.csv", вы сможете получить к нему доступ без указания пути прямо из платформы. 
В результате переменная log должна содержать загруженный из файла dataframe.

In [18]:
log = pd.read_csv('log.xls', header=None)

In [21]:
log.head(2)

                            user_id                  time  bet  win
0  Запись пользователя № - user_919  [2019-01-01 14:06:51  NaN  NaN
1  Запись пользователя № - user_973  [2019-01-01 14:51:16  NaN  NaN

In [34]:
log.columns   #выдает список колонок

Index(['user_id', 'time', 'bet', 'win'], dtype='object')

df.columns = ['new_col_name_1', 'new_col_name_2', 'new_col_name_3', 'new_col_name_4'] - переименование колонок

4.5.1. Задание  
Загрузите файл sample.csv в переменную sample, сохраните колонки в переменную columns:

In [88]:
sample = pd.read_csv('sample.xls')
columns=sample.columns

4.5.2. Задание 
Сделайте в sample заголовки колонок так, чтобы там были только маленькие буквы. Например, вместо 'Age' сделать 'age':

In [14]:
sample

            Name         City  Age Profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
5       Кузнецов         Сочи   19    Рабочий
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

In [17]:
sample.columns = ['name', 'city', 'age', 'profession']

4.5.3. Задание 
Давайте применим полученные знания для нашего датафрейма: замените в log заголовки колонок на 
user_id
time
bet
win

In [55]:
log.columns = ['user_id', 'time', 'bet', 'win']

In [23]:
log.head(2)

                            user_id                  time  bet  win
0  Запись пользователя № - user_919  [2019-01-01 14:06:51  NaN  NaN
1  Запись пользователя № - user_973  [2019-01-01 14:51:16  NaN  NaN

4.6.1. Задание  
Посмотрите, какие параметры есть у функции read_csv: в чём может быть ошибка?
С помощью правильных параметров read_csv загрузите датафрейм:

In [3]:
users = pd.read_csv('users.xls', sep='\t', encoding='KOI8-R')

In [65]:
users.head(2)

     Юзверь                 мейл     Гео
0  User_943  Accumanst@gmail.com  Ижевск
1  User_908    Advismowr@mail.ru  Ижевск

4.6.2. Задание 
Прочитайте файл в переменную users. Замените в нём названия колонок на: 
user_id
email
geo

In [4]:
users.columns = ['user_id', 'email', 'geo']

4.8 Простая фильтрация

In [22]:
users.user_id.unique()

array(['User_943', 'User_908', 'User_962', 'User_973', 'User_902',
       'User_976', 'User_955', 'User_992', 'User_978', 'User_939',
       'User_974', 'User_983', 'User_932', 'User_903', 'User_954',
       'User_918', 'User_906', 'User_941', 'User_917', 'User_947',
       'User_919', 'User_1000', 'User_998', 'User_949', 'User_946',
       'User_938', 'User_934', 'User_916', 'User_989', 'User_935',
       'User_966', 'User_928', 'User_985', 'User_960', 'User_950',
       'User_910', 'User_977', 'User_961', 'User_967', 'User_972',
       'User_957', 'User_993', 'User_991', 'User_911', 'User_931',
       'User_980', 'User_952', 'User_990', 'User_912', 'User_913',
       'User_984', 'User_969', 'User_904', 'User_953', 'User_995',
       'User_951', 'User_900', 'User_930', 'User_922', 'User_926',
       'User_982', 'User_942', 'User_958', 'User_975', 'User_933',
       'User_987', 'User_920', 'User_964', 'User_937', 'User_927',
       'User_936', 'User_905', 'User_986', 'User_915', 'User_997',
       'User_971', 'User_909', 'User_963', 'User_948', 'User_914',
       'User_968', 'User_944', 'User_924', 'User_925', 'User_940',
       'User_988', 'User_999', 'User_981', 'User_923', 'User_945',
       'User_979', 'User_994', 'User_929', 'User_907', 'User_996',
       'User_959', 'User_901', 'User_970', 'User_965', 'User_921'],
      dtype=object)

In [21]:
log.user_id.unique()

array(['Запись пользователя № - user_919',
       'Запись пользователя № - user_973',
       'Запись пользователя № - user_903',
       'Запись пользователя № - user_954',
       'Запись пользователя № - user_917',
       'Запись пользователя № - user_900',
       'Запись пользователя № - user_980',
       'Запись пользователя № - user_906',
       'Запись пользователя № - user_952',
       'Запись пользователя № - user_972',
       'Запись пользователя № - user_966',
       'Запись пользователя № - user_964',
       'Запись пользователя № - user_978',
       'Запись пользователя № - user_968',
       'Запись пользователя № - user_974',
       'Запись пользователя № - user_998',
       'Запись пользователя № - user_990',
       'Запись пользователя № - user_942',
       'Запись пользователя № - user_929',
       'Запись пользователя № - user_976',
       'Запись пользователя № - user_927',
       'Запись пользователя № - user_951',
       'Запись пользователя № - user_949',
       'Запись пользователя № - user_987',
       'Запись пользователя № - user_985',
       'Запись пользователя № - user_992',
       'Запись пользователя № - user_937',
       'Запись пользователя № - user_913',
       'Запись пользователя № - user_948',
       'Запись пользователя № - user_916',
       'Запись пользователя № - user_938',
       'Запись пользователя № - user_997',
       'Запись пользователя № - user_940',
       'Запись пользователя № - user_918',
       'Запись пользователя № - user_960',
       'Запись пользователя № - user_905',
       'Запись пользователя № - user_924',
       'Запись пользователя № - user_958',
       'Запись пользователя № - user_920',
       'Запись пользователя № - user_943',
       'Запись пользователя № - user_935',
       'Запись пользователя № - user_915',
       'Запись пользователя № - user_921',
       'Запись пользователя № - user_999',
       'Запись пользователя № - user_982',
       'Запись пользователя № - user_928',
       'Запись пользователя № - user_944',
       'Запись пользователя № - user_912',
       'Запись пользователя № - user_969',
       'Запись пользователя № - user_901',
       'Запись пользователя № - user_995',
       'Запись пользователя № - user_933',
       'Запись пользователя № - user_986',
       'Запись пользователя № - user_971',
       'Запись пользователя № - user_977',
       'Запись пользователя № - user_979',
       'Запись пользователя № - user_910',
       'Запись пользователя № - user_994',
       'Запись пользователя № - user_907',
       'Запись пользователя № - user_941',
       'Запись пользователя № - user_989',
       'Запись пользователя № - user_955',
       'Запись пользователя № - user_991',
       'Запись пользователя № - user_996',
       'Запись пользователя № - user_926',
       'Запись пользователя № - user_984',
       'Запись пользователя № - user_957',
       'Запись пользователя № - user_914',
       'Запись пользователя № - user_988',
       'Запись пользователя № - user_923',
       'Запись пользователя № - user_967',
       'Запись пользователя № - user_945',
       'Запись пользователя № - user_993',
       'Запись пользователя № - user_908',
       'Запись пользователя № - user_930',
       'Запись пользователя № - user_981',
       'Запись пользователя № - user_936',
       'Запись пользователя № - user_922',
       'Запись пользователя № - user_962',
       'Запись пользователя № - user_965',
       'Запись пользователя № - user_959',
       'Запись пользователя № - user_963',
       'Запись пользователя № - user_904',
       'Запись пользователя № - user_931',
       'Запись пользователя № - user_1000',
       'Запись пользователя № - user_946',
       'Запись пользователя № - user_970',
       'Запись пользователя № - user_939',
       'Запись пользователя № - user_961',
       'Запись пользователя № - user_911',
       'Запись пользователя № - user_950',
       'Запись пользователя № - user_956',
       'Запись пользователя № - user_909',
       'Запись пользователя № - user_983',
       'Запись пользователя № - user_902',
       'Запись пользователя № - user_947',
       'Запись пользователя № - user_975',
       'Запись пользователя № - user_953',
       'Запись пользователя № - user_925',
       'Запись пользователя № - user_934',
       'Запись пользователя № - user_932', '#error'], dtype=object)

In [7]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
user_id    100 non-null object
email      99 non-null object
geo        97 non-null object
dtypes: object(3)
memory usage: 2.4+ KB

In [9]:
sample

            Name         City  Age Profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
5       Кузнецов         Сочи   19    Рабочий
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

In [10]:
sample.Name.unique()

array(['Иванов', nan, 'sidorov', '_______', 'Кузнецов', 'Сажин',
       'Котлеревский', 'Завалишина', 'Левина', 'Фикс'], dtype=object)

In [15]:
sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
Name          10 non-null object
City          10 non-null object
Age           11 non-null int64
Profession    11 non-null object
dtypes: int64(1), object(3)
memory usage: 432.0+ bytes

4.8.1. Задание 
Создайте новый датафрейм sample2, в который будут входить только записи о людях в возрасте меньше 30 лет.

In [33]:
sample2=sample[sample.Age<30]

In [34]:
sample2

       Name    City  Age Profession
0    Иванов  Москва   25     Клинер
2    Иванов  Москва   25     Клинер
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

4.8.3. Задание 
Создайте новый датафрейм sample2, в который будут входить только записи о рабочих младше 30 лет.

In [31]:
sample2=sample[(sample.Age<30)&(sample.Profession=='Рабочий')]

4.8.2. Задание 
Создайте новый датафрейм log_win, в который будут входить только записи, где пользователь выиграл. Посчитайте, сколько таких записей и сохраните в переменной win_count.

In [38]:
log.head(6)

                            user_id                  time       bet  win
0  Запись пользователя № - user_919  [2019-01-01 14:06:51       NaN  NaN
1  Запись пользователя № - user_973  [2019-01-01 14:51:16       NaN  NaN
2  Запись пользователя № - user_903  [2019-01-01 16:31:16       NaN  NaN
3  Запись пользователя № - user_954  [2019-01-01 17:17:51       NaN  NaN
4  Запись пользователя № - user_954  [2019-01-01 21:31:18       NaN  NaN
5  Запись пользователя № - user_917  [2019-01-01 23:34:55  156789.0  NaN

In [45]:
log_win=log[log.win>0]

In [47]:
win_count=log_win.win.count()

In [49]:
win_count

138

4.9 Функция query

In [50]:
sample.query('Age>20')

            Name         City  Age Profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

In [51]:
sample.query('Age==25')

     Name    City  Age Profession
0  Иванов  Москва   25     Клинер
2  Иванов  Москва   25     Клинер

In [52]:
sample.query('City in ["Рига","Сочи"]')   #Запрос входит в список

        Name  City  Age Profession
5   Кузнецов  Сочи   19    Рабочий
10      Фикс  Рига   42    Рабочий

In [53]:
#Запрос несколько условий сразу
sample.query('City in ["Рига", "Сочи","Чебоксары", "Сургут"] & 21<Age<50 & Profession!="Менеджер"')

     Name    City  Age Profession
6   Сажин  Сургут   29    Рабочий
10   Фикс    Рига   42    Рабочий

4.9.1. Задание 
С помощью функции query найдите тех, у кого ставка меньше 2000, а выигрыш больше 0. Сохраните в новый датафрейм log2.

In [58]:
log2=log.query('bet<2000 & win>0')

In [60]:
log2.head(3)

                              user_id                  time    bet     win
151  Запись пользователя № - user_982  [2019-01-16 21:54:22  100.0  4749.0
189  Запись пользователя № - user_964  [2019-01-21 18:34:44  200.0  4667.0
205  Запись пользователя № - user_931   [2019-01-22 5:26:59  300.0  4319.0

4.10 Функции str.match и str.contains

In [62]:
sample.Name.str.match("К", na=False)  #получаем своеобразную маску

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7      True
8     False
9     False
10    False
Name: Name, dtype: bool

In [63]:
#которую мы можем наложить на датафрейм для фильтрации
sample[sample.Name.str.match("К", na=False)]

           Name        City  Age Profession
5      Кузнецов        Сочи   19    Рабочий
7  Котлеревский  Йошкар-Ола   32    Рабочий

In [64]:
#противоположный датафрейм, то есть содержащий все значения, которые условию не удовлетворяют
sample[~sample.Name.str.match("К", na=False)]

          Name         City  Age Profession
0       Иванов       Москва   25     Клинер
1          NaN    Волгоград   31   Менеджер
2       Иванов       Москва   25     Клинер
3      sidorov  Владивосток   43   Менеджер
4      _______        Курск   50   Водитель
6        Сажин       Сургут   29    Рабочий
8   Завалишина    Чебоксары   36   Менеджер
9       Левина          NaN   55    Рабочий
10        Фикс         Рига   42    Рабочий

4.10.1. Задание 
Найдите записи, где в городах есть буква «о» и сохраните в переменную sample3. 
Функция contains не может работать с пустыми значениями: необходимо использовать параметр na = False

In [67]:
sample3=sample[sample.City.str.contains("о", na=False)]

In [68]:
sample3

           Name         City  Age Profession
0        Иванов       Москва   25     Клинер
1           NaN    Волгоград   31   Менеджер
2        Иванов       Москва   25     Клинер
3       sidorov  Владивосток   43   Менеджер
5      Кузнецов         Сочи   19    Рабочий
7  Котлеревский   Йошкар-Ола   32    Рабочий
8    Завалишина    Чебоксары   36   Менеджер

4.10.2. Задание 
Найдите записи, где в городах нет буквы "о" и сохраните в переменную sample4. Не забудьте про NaN и параметр na:

In [69]:
sample4=sample[~sample.City.str.contains("о", na=False)]

In [70]:
sample4

       Name    City  Age Profession
4   _______   Курск   50   Водитель
6     Сажин  Сургут   29    Рабочий
9    Левина     NaN   55    Рабочий
10     Фикс    Рига   42    Рабочий

4.10.3. Задание 
Сохраните в переменную new_log датафрейм, из которого удалены записи с ошибкой в поле user_id:

In [71]:
new_log=log[~log.user_id.str.contains("error", na=False)]

4.11 Преобразование данных

In [74]:
#Возведём возраст в sample в квадрат
sample.Age.apply(lambda x:x**2)   #функция apply с функией в скобках типа лямбда

0      625
1      961
2      625
3     1849
4     2500
5      361
6      841
7     1024
8     1296
9     3025
10    1764
Name: Age, dtype: int64

In [75]:
#Обнулим значения возраста для всех возрастов больше 19:
def func(x):
    if x<20:
        return x
    else:
        return 0
sample.Age.apply(func)

0      0
1      0
2      0
3      0
4      0
5     19
6      0
7      0
8      0
9      0
10     0
Name: Age, dtype: int64

4.11.1. Задание  
С помощью apply и лямбда-функции увеличьте возраст во всех записях на 1 год и сохраните в sample2:

In [93]:
sample['Age'] = [x+1 for x in sample['Age']]   #еще один способ замены значения через лямбду

In [120]:
sample = pd.read_csv('sample.xls')
sample2=sample
sample2.Age=sample2.Age.apply(lambda x:x+1)
sample2.head(2)

     Name       City  Age Profession
0  Иванов     Москва   26     Клинер
1     NaN  Волгоград   32   Менеджер

4.11.2. Задание 
С помощью apply и lambda-функции замените все буквы в поле City на маленькие и сохраните в sample2. Вам может понадобится функция s.lower()

Обратите внимание: когда в столбце есть пропущенные значения, необходимо в явном виде указывать, что это str: str(s).lower()

In [122]:
sample = pd.read_csv('sample.xls')
sample2=sample
sample2.City=sample2.City.apply(lambda x:str(x).lower())
sample2

            Name         City  Age Profession
0         Иванов       москва   25     Клинер
1            NaN    волгоград   31   Менеджер
2         Иванов       москва   25     Клинер
3        sidorov  владивосток   43   Менеджер
4        _______        курск   50   Водитель
5       Кузнецов         сочи   19    Рабочий
6          Сажин       сургут   29    Рабочий
7   Котлеревский   йошкар-ола   32    Рабочий
8     Завалишина    чебоксары   36   Менеджер
9         Левина          nan   55    Рабочий
10          Фикс         рига   42    Рабочий

4.11.3. Задание  
Напишите функцию profession_code, которая на вход получает строку, а на выход возвращает: 
0 — если на вход поступила строка "Рабочий"
1 — если на вход поступила строка "Менеджер"
2 — в любом другом случае
сохраним в sample2

In [126]:
sample = pd.read_csv('sample.xls')
sample2=sample
def profession_code(s):
    if s=="Рабочий":
        return 0
    elif s=="Менеджер":
        return 1
    else:
        return 2
sample2.Profession=sample2.Profession.apply(profession_code)
sample2

            Name         City  Age  Profession
0         Иванов       Москва   25           2
1            NaN    Волгоград   31           1
2         Иванов       Москва   25           2
3        sidorov  Владивосток   43           1
4        _______        Курск   50           2
5       Кузнецов         Сочи   19           0
6          Сажин       Сургут   29           0
7   Котлеревский   Йошкар-Ола   32           0
8     Завалишина    Чебоксары   36           1
9         Левина          NaN   55           0
10          Фикс         Рига   42           0

4.11.5. Задание 
Напишите функцию age_category, которая на вход получает число, а на выход отдаёт: 
"молодой" — если возраст меньше 23
"средний" — если возраст от 23 до 35
"зрелый" — если возраст больше 35

4.11.6. Задание  
Примените функцию age_category и apply, чтобы создать новую колонку в sample под названием 'Age_category'. 
Вспомним, как создать новую колонку: df['new_column'] = df.old_column.apply(func)

In [131]:
sample = pd.read_csv('sample.xls')
sample2=sample
def age_category(age):
    if age<23:
        return "молодой"
    elif 35>age>23:
        return "средний"
    elif 35<age:
        return "зрелый"
sample2['Age_category']=sample2.Age.apply(age_category)
sample2

            Name         City  Age Profession Age_category
0         Иванов       Москва   25     Клинер      средний
1            NaN    Волгоград   31   Менеджер      средний
2         Иванов       Москва   25     Клинер      средний
3        sidorov  Владивосток   43   Менеджер       зрелый
4        _______        Курск   50   Водитель       зрелый
5       Кузнецов         Сочи   19    Рабочий      молодой
6          Сажин       Сургут   29    Рабочий      средний
7   Котлеревский   Йошкар-Ола   32    Рабочий      средний
8     Завалишина    Чебоксары   36   Менеджер       зрелый
9         Левина          NaN   55    Рабочий       зрелый
10          Фикс         Рига   42    Рабочий       зрелый

4.11.7. Задание 
Преобразуем поле user_id в датафрейме log, оставив только идентификатор пользователя. Например, вместо "Запись пользователя № — user_974" должно остаться только "user_974"
На месте записей с ошибками в user_id должна быть пустая строка "". Сделайте это через apply и новую функцию, которую вы создадите. Результат сохраните в log:

In [133]:
log.head(2)

                            user_id                  time  bet  win
0  Запись пользователя № - user_919  [2019-01-01 14:06:51  NaN  NaN
1  Запись пользователя № - user_973  [2019-01-01 14:51:16  NaN  NaN

In [138]:
log.user_id=log.user_id.apply(lambda x:str(x)[24:])

In [140]:
log.head(2)

    user_id                  time  bet  win
0  user_919  [2019-01-01 14:06:51  NaN  NaN
1  user_973  [2019-01-01 14:51:16  NaN  NaN

4.11.8. Задание 
Загрузите log.csv в log, удалите квадратную скобку из первой строчки в столбце time, чтобы привести его к более привычному формату.
t равен log.time[0]
Сохраните результат в t.

In [143]:
log = pd.read_csv('log.xls', header=None)
log.columns = ['user_id','time','bet','win']
t = log.time[0]
t=str(t)[1:]
t

'2019-01-01 14:06:51'

4.11.9. Задание 
Уберём ненужную скобку квадратную скобку из поля в time.
Результат сохраните в log:

In [154]:
log = pd.read_csv('log.xls', header=None)
log.columns = ['user_id','time','bet','win']
def new_time(s):
    if type(s)==str:
        return s[1:]
    elif type(s)==float:      # NaN это тип float
        return None
log.time=log.time.apply(new_time)

In [156]:
log.tail()

                              user_id                time      bet      win
995  Запись пользователя № - user_984  2019-04-20 9:59:58   9754.0      NaN
996                            #error                None  10054.0  29265.0
997                            #error                None  10454.0      NaN
998                            #error                None   1000.0      NaN
999                            #error                None  10754.0      NaN

4.12 Финальное задание
Соединим всё, что мы делали, и очистим файл log.csv. А именно: 
Прочитаем файл в переменную log.
Добавим названия колонок user_id, time, bet, win.
Удалим значения user_id с ошибками.
Оставим в user_id только значения идентификатора.
Уберём начальную скобку из поля time.

In [164]:
log = pd.read_csv('log.xls', header=None)
log.columns = ['user_id','time','bet','win']
log=log[~log.user_id.str.contains("error", na=False)]
log.user_id=log.user_id.apply(lambda x:str(x)[24:])
def new_time(s):
    if type(s)==str:
        return s[1:]
    elif type(s)==float:      # NaN это тип float
        return None
log.time=log.time.apply(new_time)

In [167]:
log.tail()

      user_id                 time      bet     win
991  user_965  2019-04-20 12:55:41    800.0  6927.0
992  user_967  2019-04-20 14:59:36  10154.0     NaN
993  user_973  2019-04-20 17:09:56  10254.0     NaN
994  user_977  2019-04-20 18:10:07  10354.0     NaN
995  user_984   2019-04-20 9:59:58   9754.0     NaN